// 1) Використовуючи оператор "Рівності (==)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let age1 = 30;
let age2 = 50;
console.log(age1 == age2)

let x = 5;
let y = 5;
console.log(x == y)

// 2) Використовуючи оператор "Нерівності (!=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let user1 = 15;
let user2 = 15;
console.log (user1 != user2)

let a = 50;
let c = 80;
console.log(a != c)

// 3) Використовуючи оператор "Строгої рівності (===)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let vs = 12;
let bs = '12'
console.log(vs === bs)

let u = 85;
let t = 85;
console.log(u === t)

// 4) Використовуючи оператор "Строгої нерівності (!==)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let p = 65;
let z = 65;
console.log(p !== z)

let w = 90;
let q = '90'
console.log(w !== q)

// 5) Використовуючи оператор "Більше ніж (>)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let sum1 = 55;
let sum2 = 60;
console.log(sum1>sum2)

let num1 = 100;
let num2 = 99;
console.log (num1>num2)

// 6) Використовуючи оператор "Більше чи дорівнює (>=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let x = 65;
let y = 90;
console.log(x>=y)

let m = 12;
let n = 12;
console.log(m>=n)

// 7) Використовуючи оператор "Менше ніж (<)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let emp1 = 22;
let emp2 = 20;
console.log(emp1<emp2)

let emp1 = 20;
let emp2 = 22;
console.log(emp1<emp2)

// 8) Використовуючи оператор "Менше чи дорівнює (<=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let cont1 = 56;
let cont2 = 23;
console.log (cont1<=cont2)

let ppl1 = 89;
let ppl2 = 90;
console.log(ppl1<=ppl2)

// 9) Використовуючи оператор "Логічне І (&&)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let pet1 = 'cat'
let pet2 = 'dog'
console.log(pet1 === 'hamster' && pet2 === 'mouse')

let bird1 = 'crow'
let bird2 = 'eagle'
console.log(bird1 === 'crow' && bird2 === 'eagle')

// 10) Використовуючи оператор "Логічне АБО (||)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let r = 25;
let g = 18;
console.log(r === 23 || g === 85)

let h = 85;
let l = 33;
console.log(h === 7 || l === 33)

// 11) Використовуючи оператор "Логічне НЕ (!)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let a =18
let b = 13
console.log(!a)

console.log(!!b)

// 12) Використовуючи оператор "Рядкове додавання (+)" додайте два значення типу "string".
// * Виведіть результат в консоль за допомогою "console.log"

let a = 'hello'
console.log(a + ' everyone!')

//or

let firstName = 'John '
let lastName = 'Smith'
console.log(firstName + lastName)

//or

console.log('Big' + ' Bang')

// 13) За допомогою тернарного оператору присвойте значення у змінну "type" використовуючи змінну "color". Якщо колір дорівнює "червоний", тоді значення змінної має бути "пожежна" інакше "медична".
// * Виведіть "type" в консоль за допомогою "console.log". Зробіть два варіанти в одному резyльтат в консолі має бути "пожежна" в іншому "медична"

let color = 'червоний';
let type = (color == 'червоний') ? 'пожежна' : 'медична';
console.log(type)

let color = 'блакитний';
let type = (color == 'червоний') ? 'пожежна' : 'медична';
console.log(type)

// 14) Створіть об'єкт з довільними ключами і видаліть довільний ключ за допомогою оператору "delete"
// * Виведіть результат в консоль за допомогою "console.log"
let people = {name1: 'Jack', name2: 'John', name3: 'Anna'}
delete people.name3
console.log(people)

// 15) Створіть масив з довільними значеннями і видаліть довільне значення за допомогою оператору "delete"
// * Виведіть результат в консоль за допомогою "console.log"
 
let ae = ['desk', 'pen', 'book', 'meat']
delete ae[3]
console.log(ae)

// 16) Створіть об'єкт з довільними ключами і за допомогою оператору "in" визначіть наявність ключів у об'єкті. Одне значення повинно бути наявне а інше повинно бути відсутнє
// * Виведіть результат в консоль за допомогою "console.log"

let people = {name1: 'Jane', name2: 'Sally', name3: 'Anna'}
console.log('name2' in people)

let people = {name1: 'Jane', name2: 'Sally', name3: 'Anna'}
console.log('name' in people)

// 16) Створіть масив з довільними значеннями і за допомогою оператору "in" визначіть наявність значення у масиві. Одне значення повинно бути наявне а інше повинно бути відсутнє
// * Виведіть результат в консоль за допомогою "console.log"

let vegFood = ['tofu', 'humus', 'carrot']
console.log(2 in vegFood)

let vegFood = ['tofu', 'humus', 'carrot']
console.log(5 in vegFood)